<a href="https://colab.research.google.com/github/DatadevWil/Estudo/blob/main/King_County_Desafio.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

This dataset contains house sale prices for King County, which includes Seattle. It includes homes sold between May 2014 and May 2015.

It's a great dataset for evaluating simple regression models.

In [1]:
import pandas as pd

In [58]:
base = pd.read_csv("kc_house_data.csv")
base.head()

           id             date     price  ...     long  sqft_living15  sqft_lot15
0  7129300520  20141013T000000  221900.0  ... -122.257           1340        5650
1  6414100192  20141209T000000  538000.0  ... -122.319           1690        7639
2  5631500400  20150225T000000  180000.0  ... -122.233           2720        8062
3  2487200875  20141209T000000  604000.0  ... -122.393           1360        5000
4  1954400510  20150218T000000  510000.0  ... -122.045           1800        7503

[5 rows x 21 columns]

In [59]:
base.shape

(21613, 21)

In [60]:
base['date'] = base['date'].apply(lambda x : x.split('T')[0])

In [61]:
base.dtypes

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

In [62]:
base['date'] = base['date'].apply(lambda x : f'{x[0:4]}-{x[4:6]}-{x[6:]}')

In [63]:
base.head()

           id        date     price  ...     long  sqft_living15  sqft_lot15
0  7129300520  2014-10-13  221900.0  ... -122.257           1340        5650
1  6414100192  2014-12-09  538000.0  ... -122.319           1690        7639
2  5631500400  2015-02-25  180000.0  ... -122.233           2720        8062
3  2487200875  2014-12-09  604000.0  ... -122.393           1360        5000
4  1954400510  2015-02-18  510000.0  ... -122.045           1800        7503

[5 rows x 21 columns]

In [64]:
base = base.rename({'date': 'Data'}, axis = 1)
base.head()

           id        Data     price  ...     long  sqft_living15  sqft_lot15
0  7129300520  2014-10-13  221900.0  ... -122.257           1340        5650
1  6414100192  2014-12-09  538000.0  ... -122.319           1690        7639
2  5631500400  2015-02-25  180000.0  ... -122.233           2720        8062
3  2487200875  2014-12-09  604000.0  ... -122.393           1360        5000
4  1954400510  2015-02-18  510000.0  ... -122.045           1800        7503

[5 rows x 21 columns]

In [65]:
base = base.rename({'price': 'Preço','bedrooms': 'Quartos'}, axis = 1)
base.head()

           id        Data     Preço  ...     long  sqft_living15  sqft_lot15
0  7129300520  2014-10-13  221900.0  ... -122.257           1340        5650
1  6414100192  2014-12-09  538000.0  ... -122.319           1690        7639
2  5631500400  2015-02-25  180000.0  ... -122.233           2720        8062
3  2487200875  2014-12-09  604000.0  ... -122.393           1360        5000
4  1954400510  2015-02-18  510000.0  ... -122.045           1800        7503

[5 rows x 21 columns]

In [66]:
base = base.rename({'bathrooms': 'Banheiros','sqft_living':'Metragem_casa','sqft_lot':'Metragem_lote','floors':'Andares','waterfront':'Vista_mar','view':'Visita','condition':'Condições','grade':'Nota','sqft_above':'Metragem_superior','sqft_basement':'Metragem_porão','yr_built':'Ano_construção','yr_renovated':'Ano_reforma','zipcode':'Código_postal','lat':'Latitude','long':'Longitude','sqft_living15':'Metragem_útil_2015','sqft_lot15':'Metragem_lote_2015'}, axis = 1)
base

               id        Data  ...  Metragem_útil_2015  Metragem_lote_2015
0      7129300520  2014-10-13  ...                1340                5650
1      6414100192  2014-12-09  ...                1690                7639
2      5631500400  2015-02-25  ...                2720                8062
3      2487200875  2014-12-09  ...                1360                5000
4      1954400510  2015-02-18  ...                1800                7503
...           ...         ...  ...                 ...                 ...
21608   263000018  2014-05-21  ...                1530                1509
21609  6600060120  2015-02-23  ...                1830                7200
21610  1523300141  2014-06-23  ...                1020                2007
21611   291310100  2015-01-16  ...                1410                1287
21612  1523300157  2014-10-15  ...                1020                1357

[21613 rows x 21 columns]

In [67]:
base['Preço'].describe()

count    2.161300e+04
mean     5.400881e+05
std      3.671272e+05
min      7.500000e+04
25%      3.219500e+05
50%      4.500000e+05
75%      6.450000e+05
max      7.700000e+06
Name: Preço, dtype: float64

In [78]:
me = min(base)
me

TypeError: ignored